// !绘制polygon信息
const PaintConfig = {
  polygonPath :{
    jiangxia : [[[114.408298,30.463423], [114.408941,30.468935],
    [114.413641,30.46899], [114.416087,30.465476], 
    [114.408298,30.463423]]],
    hongsan:[[114.363307,30.466366], [114.36953,30.478313], [114.347643,30.477351]
            ,[114.348845,30.471063], [114.363307,30.466366]],
    guanggu:[[114.204982,30.521236], [114.2073,30.529184], [114.218415,30.525081]
            ,[114.214252,30.519387],[114.204982,30.521236]]
  },
  markerPath : {
    jiangxia: [[114.411687,30.46852], [114.409498,30.464895], [114.414605,30.465839]],
    hongsan: [[114.355267,30.472701], [114.365867,30.476474], [114.362648,30.469261]],
    guanggu: [[114.212258,30.524644], [114.206593,30.526233], [114.211743,30.520281]]
  },
  // market样式
  markerStyle: {
    background: `url('/icon/marker.png')`,
    backgroundSize: 'contain',
    backgroundRepeat: 'no-repeat',
    backgroundPosition: 'center',
    width: '30px',
    height: '40px',
    textAlign: 'center',
    lineHeight: '40px'
  }
}
export default PaintConfig